/*
1, 2, 3 더하기 성공출처다국어분류
시간 제한	메모리 제한	제출	정답	맞은 사람	정답 비율
1 초 (추가 시간 없음)	512 MB	59044	37867	25118	62.106%
문제
정수 4를 1, 2, 3의 합으로 나타내는 방법은 총 7가지가 있다. 합을 나타낼 때는 수를 1개 이상 사용해야 한다.

1+1+1+1
1+1+2
1+2+1
2+1+1
2+2
1+3
3+1
정수 n이 주어졌을 때, n을 1, 2, 3의 합으로 나타내는 방법의 수를 구하는 프로그램을 작성하시오.

입력
첫째 줄에 테스트 케이스의 개수 T가 주어진다. 각 테스트 케이스는 한 줄로 이루어져 있고, 정수 n이 주어진다. n은 양수이며 11보다 작다.

출력
각 테스트 케이스마다, n을 1, 2, 3의 합으로 나타내는 방법의 수를 출력한다.

예제 입력 1 
3
4
7
10
예제 출력 1 
7
44
274
*/

// 풀이
import java.util.*;

public class Main {
    public static void main(String args[]) {
     // 식은 짧은데 생각보다 생각해내기는 어려웠다.
     // 풀이과정은 다음과 같다.
     // 먼저 1, 2, 3을 이용해 1, 2, 3을 만드는 방법은
     // (1) / (1, 1), (2) / (1, 1, 1), (1, 2), (2, 1), (3) -> 1, 2, 4개씩이다.
     // 다음으로 4를 구하는 방법인데, 생각을 해보니, 1+[3을 구하는 방법], 2+[2를 구하는 방법], 3+[1을 구하는 방법] 이렇게 하면 구할 수 있었다.
     // 그렇게 N을 구하는 방법도 1+[N-1], 2+[N-2], 3+[N-3] ... 이렇게 구하면 되었다.
        Scanner sc = new Scanner(System.in);
        int N = sc.nextInt();
        int num[] = new int[22];
        num[1] = 1;
        num[2] = 2;
        num[3] = 4;
        for(int i=4; i<22; i++)
            num[i] = num[i-1] + num[i-2] + num[i-3];
        
        for(int i=0; i<N; i++){
            System.out.println(num[sc.nextInt()]);
        }
        
    }
}
