/*
멀쩡한 사각형
문제 설명
가로 길이가 Wcm, 세로 길이가 Hcm인 직사각형 종이가 있습니다. 종이에는 가로, 세로 방향과 평행하게 격자 형태로 선이 그어져 있으며, 모든 격자칸은 1cm x 1cm 크기입니다. 이 종이를 격자 선을 따라 1cm × 1cm의 정사각형으로 잘라 사용할 예정이었는데, 누군가가 이 종이를 대각선 꼭지점 2개를 잇는 방향으로 잘라 놓았습니다. 그러므로 현재 직사각형 종이는 크기가 같은 직각삼각형 2개로 나누어진 상태입니다. 새로운 종이를 구할 수 없는 상태이기 때문에, 이 종이에서 원래 종이의 가로, 세로 방향과 평행하게 1cm × 1cm로 잘라 사용할 수 있는 만큼만 사용하기로 하였습니다.
가로의 길이 W와 세로의 길이 H가 주어질 때, 사용할 수 있는 정사각형의 개수를 구하는 solution 함수를 완성해 주세요.

제한사항
W, H : 1억 이하의 자연수
입출력 예
W	H	result
8	12	80
입출력 예 설명
입출력 예 #1
가로가 8, 세로가 12인 직사각형을 대각선 방향으로 자르면 총 16개 정사각형을 사용할 수 없게 됩니다. 원래 직사각형에서는 96개의 정사각형을 만들 수 있었으므로, 96 - 16 = 80 을 반환합니다.
*/

// 풀이
import java.util.*;

class Solution {
    public long solution(int w, int h) {
        long answer = 1;
        
        int smallNum = Math.min(w, h);  // 둘 중 작은수를 구해서 이를 통해 최대공약수를 구할 것이다.
        int max = 1;
        for(int i=smallNum; i>0; i--){    // 최대공약수 max를 가져온다.
            if(w%i==0 && h%i==0){
                max = i;
                break;
            }
        }
        
        // 코드는 간단해 보이지만 진짜 고민을 많이 했다..
        // 사각형의 경우 문제에서 8*12 사각형이며 짤리는 부분은 일정 패턴을 가지고 최대공약수 만큼 개수가 나온다.
        // 그리고 짤리는 내용들은 왼쪽, 오른쪽 기준으로 그 길이를 최대공약수로 나는 것 만큼에 1개를 더하면 된다. 
       
        answer = (long)w*h - ((long)(w/max)+(long)(h/max)-1)*max;
        
        return answer;
    }
}
